%%遗传算法求解vrp问题(为选择操作从新设计后程序)
%D是距离矩阵，n为种群个数
%C为停止代数，遗传到第 C代时程序停止,C的具体取值视问题的规模和耗费的时间而定
%m为适配值淘汰加速指数,最好取为1,2,3,4,不宜太大
%交叉概率Pc，变异概率Pm 
%R为最短路径,Rlength为路径长度
function VRP

%初始化
demand=[0 1 2 1 2 1 4 2 2];
D=[ 0 4 6 7.5 9 20 10 16 8;
    4 0 6.5 4 10 5 7.5 11 10;
    6 6.5 0 7.5 10 10 7.5 7.5 7.5;
    7.5 4 7.5 0 10 5 9 9 15;
    9 10 10 10 0 10 7.5 7.5 10;
    20 5 10 5 10 0 7 7 7.5;
    10 7.5 7.5 9 7.5 7 0 0 10;
    16 11 7.5 9 7.5 9 7 10 10;
    8 10 7.5 15 10 7.5 10 10 0];
            
n=100;
C=200;
m=2;
Pc=0.9;
Pm=0.2;


[R,Rlength]=geneticVRP(D,demand,n,C,m,Pc,Pm);%运算返回最优路径R和其总距离Rlength